src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/incompressible/simpleFoam/backwardFacingStep2D/system/sampleCp
type            patchProbes;
libs            (sampling);
writeControl    writeTime;

patch           lowerWall;
probeLocations  ();
fields          (cp);
