src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/incompressible/simpleFoam/backwardFacingStep2D/system/stressComponents
type            turbulenceFields;
libs            (fieldFunctionObjects);

writeControl    writeTime;

fields          (devReff);
